niciwalter99/smart-fuel/Software/Puk/nRF5_SDK_17.1.0_ddde560/examples/ble_peripheral/smart_fuel/main.c
}


void hx711_callback(hx711_evt_t evt, int value)
{
    hx711_stop();
    //hx711_power_down();
    uint16_t length = sizeof(int);
    
    
    
    if(evt == DATA_READY)
    {
        /* Transmit received sensor data over BLE - ignoring return value. Packets will be dropped
         if:
         -  Not connected
         -  Client has not enabled Notification on the TX characteristic
         -  TX buffer is full*/
        if(!hx711_offset_set) {
          hx711_offset_set = true;
          hx711_offset = value;

        } else{
          int value_with_offset = (value - hx711_offset);
          uint32_t weigth = 0;
          if (value_with_offset > 0) {
            weigth = value_with_offset / 216;
          } 
          if(!wait_for_delete) {
            uint8_t rounded_value = round(weigth / 10.0f);
            write_boot_count(rounded_value);
          } else {
            NRF_LOG_INFO("Wait for Delete end");
          }
          //ble_lbs_on_button_change(m_conn_handle, &m_lbs, weigth);
          //get_data_information(m_conn_handle, &m_lbs);
          NRF_LOG_INFO("Weight value %d", weigth);
        }
    }
    else
    {
        /*Invalid ADC readout. A non-zero value would indicate that the readout was interrupted 
         by a higher priority interrupt during readout (i.e., Softdevice radio event).
         */
        NRF_LOG_INFO("ADC readout error. %d 0x%x", value, value);
        write_boot_count(0); // 0 value is noise
    }
}

void mpu_init(void)
{

    ret_code_t ret_code;
    // Initiate MPU driver
    ret_code = app_mpu_init();
    APP_ERROR_CHECK(ret_code); // Check for errors in return value
    
    // Setup and configure the MPU with intial values
    app_mpu_config_t p_mpu_config = MPU_DEFAULT_CONFIG(); // Load default values
    p_mpu_config.smplrt_div = 19;   // Change sampelrate. Sample Rate = Gyroscope Output Rate / (1 + SMPLRT_DIV). 19 gives a sample rate of 50Hz
    p_mpu_config.accel_config.afs_sel = AFS_2G; // Set accelerometer full scale range to 2G
    ret_code = app_mpu_config(&p_mpu_config); // Configure the MPU with above values
    APP_ERROR_CHECK(ret_code); // Check for errors in return value 

}


/**@brief Function for application main entry.
 */
int main(void)
{
    // Initialize.
    hx711_init(INPUT_CH_A_128, hx711_callback);
    log_init();
    //leds_init();
    timers_init();
    NRF_LOG_INFO("Blinky example started.");

    lfclk_config();
    rtc_config();
    NRF_LOG_INFO("Blinky example started.");

    ble_stack_init();
    NRF_LOG_INFO("Init Storage");
    storage_init();
    mpu_init();
    //NRF_LOG_INFO("write boot count");
    write_boot_count(0);
    //NRF_LOG_INFO("get boot ocunt");
    //uint8_t boot_count[4000];
    //uint8_t *p = get_boot_count(boot_count);
    //NRF_LOG_INFO("Get Boot Count %d", p[0]);
    //NRF_LOG_INFO("Get Boot Count %d", p[1]);

    power_management_init();
    buttons_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
  
    // Start execution.
    NRF_LOG_INFO("Blinky example started.");
    //NRF_LOG_PROCESS();
    advertising_start();

    // Enter main loop.
    for (;;)
    {
       idle_state_handle();
    }
}


/**
 * @}
 */
